modules/gateway/gateway-management-client/src/test/resources/com/l7tech/gateway/client/testMessages/ClusterProperty_Put_Response.xml

<env:Envelope xmlns:env="http://www.w3.org/2003/05/soap-envelope"
              xmlns:l7="http://ns.l7tech.com/2010/01/gateway-management"
              xmlns:mdo="http://schemas.wiseman.dev.java.net/metadata/messagetypes"
              xmlns:mex="http://schemas.xmlsoap.org/ws/2004/09/mex"
              xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/08/addressing"
              xmlns:wse="http://schemas.xmlsoap.org/ws/2004/08/eventing"
              xmlns:wsen="http://schemas.xmlsoap.org/ws/2004/09/enumeration"
              xmlns:wsman="http://schemas.dmtf.org/wbem/wsman/1/wsman.xsd"
              xmlns:wsmeta="http://schemas.dmtf.org/wbem/wsman/1/wsman/version1.0.0.a/default-addressing-model.xsd"
              xmlns:wxf="http://schemas.xmlsoap.org/ws/2004/09/transfer" xmlns:xs="http://www.w3.org/2001/XMLSchema">
    <env:Header>
        <wsa:Action xmlns:ns11="http://ns.l7tech.com/2010/01/gateway-management" env:mustUnderstand="true">http://schemas.xmlsoap.org/ws/2004/09/transfer/PutResponse</wsa:Action>
        <wsa:MessageID env:mustUnderstand="true">uuid:f90089ec-a844-4734-82a4-22af0411a2e1</wsa:MessageID>
        <wsa:RelatesTo>uuid:9c6b21fb-941a-4393-ae74-692487cdfb79</wsa:RelatesTo>
        <wsa:To env:mustUnderstand="true">http://schemas.xmlsoap.org/ws/2004/08/addressing/role/anonymous</wsa:To>
    </env:Header>
    <env:Body>
        <l7:ClusterProperty id="264372224" version="1">
            <l7:Name>testproperty</l7:Name>
            <l7:Value>testvalue2</l7:Value>
        </l7:ClusterProperty>
    </env:Body>
</env:Envelope>